# HasAnEdgeNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..HasAnEdgeNumber Method
RebarConstraint Class See Also
---
Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasAnEdgeNumber()
```

Visual Basic
---
```text
Public Function HasAnEdgeNumber As Boolean
```

Visual C++
---
```text
public:
bool HasAnEdgeNumber()
```

# Remarks
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the RebarTargetConstraintType must be 'Edge' or 'BarBend.'
# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace